itog/src/InformationRegisters/ИсторияИзмененийМетодаСписания/ИсторияИзмененийМетодаСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийМетодаСписания</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

itog/src/CommonModules/РаботаСУчетнойПолитикойКлиентСервер/Module.bsl
&НаСервере
Функция ПроверитьРазрешениеУстановкиМетодаСписания () Экспорт 
	
ТекущееЗначение = РегистрыСведений.ИсторияИзмененийМетодаСписания.СрезПоследних(ТекущаяДата());

Если ТекущееЗначение.Количество() <> 0 Тогда 
	Если Год(ТекущееЗначение[0].ДатаУстановки) < Год(ТекущаяДата()) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь; 
	КонецЕсли;
Иначе
	Возврат Истина;	
КонецЕсли;

КонецФункции 

&НаСервере
Процедура ЗаписатьИсториюИзмененияМетодаСписания(МетодСписания) Экспорт 
	МенеджерЗаписи = РегистрыСведений.ИсторияИзмененийМетодаСписания.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаУстановки = ТекущаяДата();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.МетодСписания = МетодСписания;
	МенеджерЗаписи.Записать(Ложь);
КонецПроцедуры
